Revit 2027 API
LogicalAndFilter(IList<ElementFilter>) Constructor
 Constructs a new instance of the logical filter with any number of input filters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LogicalAndFilter(
	IList<ElementFilter> filters
)
Public Sub New (
	filters As IList(Of ElementFilter)
)
public:
LogicalAndFilter(
	IList<ElementFilter^>^ filters
)
new :
        filters : IList<ElementFilter> -> LogicalAndFilter
Parameters
filters IList<ElementFilter>
 A collection of input filters.
Exceptions
Exception | Condition
ArgumentException |  The filter collection is empty, or contains invalid inputs.
ArgumentNullException |  A non-optional argument was null
Remarks
 The input filters will be copied.
See Also
Reference
LogicalAndFilter Class
LogicalAndFilter Overload
Autodesk.Revit.DB Namespace